<template>
  <div class="video-page">
    <div class="video-description">
      <h2>实现Java类继承、方法重载、重写</h2>
    </div>
    <div class="text-intro">
      <h2>继承概述</h2>
      <p>多个类中存在相同属性和行为时，将这些内容抽取到单独
        一个类中，那么多个类无需再定义这些属性和行为，只要
        继承那个类即可。</p>
      <p>继承关键字：extends</p>
      <p>语法： class 子类名 extends 父类名</p>
      <p>有了继承以后，我们定义一个类的时候，可以在一个已经
        存在的类的基础上，还可以定义自己的新成员。</p>

      <h3>分析讲解</h3>
      <p>通过一个具体案例来演示代码</p>
      <p>学生类和老师类，都具有两个功能(吃饭，睡觉)
        考虑：设计一个父类“人”，用继承实现。</p>
      <h4>继承的好处</h4>
      <p>提高了代码的复用性
        多个类相同的成员可以放到同一个类中
      </p>
      <p>提高了代码的维护性
        如果功能的代码需要修改，修改一处即可</p>
      <h3>演示操作</h3>
      <p>请编写一个父类 “人”，编写两个子类 “学生”和
        “老师”。分别实现方法的继承、重写和父类方法
        的调用。</p>
      <h3>知识小结</h3>
      <p>1.编写父类和子类构造继承关系</p>
      <p>2.对非私有成员，子类可继承父类</p>
      <p>3.对子类的新功能，子类可以选择重写父类方法</p>
      <p>4.子类若想调用父类方法，使用super关键字</p>
      <h3>能力拓展</h3>
      <p>完成一个父类Animal的编写，分别编写子类Dog、 Cat
        和Pig类继承父类，并分别实现shout方法。</p>
      <h3>接口概述</h3>
      <p>为了体现事物功能的扩展性，Java中提供了接口来定义这
        些额外功能，在接口中并不给出具体实现，只定义抽象方法。
        具体的实现由实现类完成。</p>
      <h3>接口特点</h3>
      <p>接口用关键字interface表示
        语法格式： interface 接口名</p>
      <p>类实现接口用implements表示
        语法格式： class 类名 implements 接口名 0</p>
      <h3>接口的成员</h3>
      <p>·成员变量
        只能是常量， 默认修饰符 pub lic static final</p>
      <p>·构造方法
        没有，因为接口主要是扩展功能的，而没有具体存在</p>
      <p>成员方法
        只能是抽象方法，默认修饰符 public abstract</p>
    </div>
  </div>
</template>


